{
  "website":{
    "title": "Shiluo's blog"
  },
  "nav":{
    "home": "Home",
    "about_me": "About",
    "skills": "Skills",
    "projects": "Projects",
    "career": "Career",
    "blog": "Blog",
    "link": "Link"
  },
  "about_me":{
    "about_me": "About Me",
    "des": "I'm a programmer skilled in Scala, Java, Python, C, and JavaScript. Student at University at Buffalo studying Bachelor's degree focused in Computer Science. Since 2013, my multiple personal projects and experiences have helped me gain valuable experience in network architecture, data structure, project maintenance and management. Now, I have interest in the Internet of Things(IoT), networks and artificial intelligence, but at the same time I am still exploring various fields of computer science. I am currently learning Theory of Computation and Programming Languages."
  },
  "skills":{
    "my_skills": "My Skills"
  },
  "projects":{
    "NFTA-process-data_desc": "Process GPS data downloaded from the Niagara Frontier Transportation Authority (NFTA) sftp and use these data to predict road conditions.",
    "vc_ranking_desc": "Maintain the most authoritative leaderboard in a sub-cultural community with 27+ million total plays.Collect and record staff information and status of over 100 songs every week. Calculate rankings based on data and make videos to introduce songs"
  },
  "career":{
    "my_career": "My Career",
    "ub_name": "University at Buffalo",
    "ub_student_desc": "B.S. Computer Science | Expected Graduation: May 2022 | GPA: 4.0/4.0",
    "ub_student_date": "Aug 2018 - Present",
    "ub_student_job": "Student",
    "ub_ra_desc": "Research Assistant at the Universal at Buffalo. Working under Dr. Su",
    "ub_ra_date": "Jun 2020 - Present",
    "ub_ra_job": "Research Assistant",
    "hdedu_name": "HD Education",
    "hdedu_desc": "Tutored 10+ undergraduate students on course of programming, data structures, and software design. Tutored 30+ students in Scala and C programming. Planned Individual programs of study to develop student’s interest and abilities",
    "hdedu_date": "Nov 2018 - Present",
    "hdedu_job": "Tutor",
    "ub_campusLiving_name": "UB Campus Living Resident Fitness Center",
    "ub_campusLiving_desc": "Responsible for implementation for residential fitness centers serving 1,000+ residential students. Train and indirectly supervise 40+ student employee Fitness Monitors",
    "ub_campusLiving_date": "Sep 2018 - May 2020",
    "ub_campusLiving_job": "Student Coordinator",
    "cdi_name": "Comprehensive Youth Development",
    "cdi_tutor_desc": "Help the 20+ students studying on New York state regent exam. Assist students to solve problems in their homework",
    "cdi_tutor_date": "Sep 2017 - Jun 2018",
    "cdi_tutor_job": "Tutor",
    "cu_summer_name": "Cooper Union Summer STEM Program",
    "cu_summer_desc": "Worked with other students to design and build a machine out of used magnets, wood and paint. Learned how to use basic manual and power tools, and create a Rube-Goldberg machine",
    "cu_summer_date": "Jul 2017 - Aug 2017",
    "cu_summer_job": "Team Leader",
    "aws_name": "Amazon Web Services (AWS)",
    "aws_intern1_desc": "Collaboratively designed, implemented, and tested a Java microservice from scratch for a greenfield project. Added several new frontend components using React and Redux. Utilized DynamoDB, Fargate, ECS, API Gateway, Cloudwatch and other AWS services",
    "aws_intern1_date": "May 2021 - Aug 2021",
    "aws_intern_job": "Software Development Engineer Intern"
  },
  "blog":{
    "my_blog": "My Blog"
  },
  "link":{
    "link": "Link",
    "view": "views"
  }

}
